openFoam/flow_past_sphere/2spheres/system/forces/forceCoeffsCompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is compressible (pressure is
    in units M/(LT^2), e.g. Pa).

\*---------------------------------------------------------------------------*/

patches     (patch1 patch2);

magUInf     20;
rhoInf      1.225;
lRef        1;
Aref        1;

liftDir     (0 0 1);
dragDir     (1 0 0);

CofR        (0 0 0);
pitchAxis   (0 1 0);

#includeEtc "caseDicts/postProcessing/forces/forceCoeffs.cfg"

// ************************************************************************* //
