openFoam/flow_past_sphere/2spheres/system/forces/forces.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            forces;
libs            ("libforces.so");

writeControl    timeStep;
writeInterval   1;

log             off;

// ************************************************************************* //
