openFoam/flow_past_sphere/2spheres/system/forces/forcesCompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is compressible (pressure is in units M/(LT^2), e.g. Pa).

\*---------------------------------------------------------------------------*/

patches     (patch1 patch2);

CofR        (0 0 0);
pitchAxis   (0 1 0);

#includeEtc "caseDicts/postProcessing/forces/forces.cfg"

// ************************************************************************* //
